# 创建和访问字典，标志性大括号 ： { key:words}    
emptydict = {}

dict1 = {'老四':'大家好，我是老四',\
         '阿雄':'一条这么小的石九公啊!',\
         '阿峰':'这是要发财的节奏！',\
         '华农兄弟':'这只竹鼠中暑了，这样下去不行，不如......',\
         '信誓蛋蛋':'Life is fantastic'}
print('王下七赶海阿峰说:',dict1['阿峰'])

dict2 = {1:'老四',2:'阿雄',3:'华农兄弟',4:'信誓蛋蛋'}
print('某位知名Up主飘过:',dict2[3])

# 使用 dict()函数创建字典
dict3 = dict(((1,'角角'),(2,'外行员'),(3,'阿一')))  #由于该格式下dict()函数中只有一个参数，
                                                    #所以要用元组进行打包，所以括号较多
dict4 = dict(老四 = '大家好，我是老四',阿雄 = '一条这么小的石九公啊!') #用关键字参数创建字典

# 改变/添加 key 中的 words 的内容,
dict4['老四'] = '忍不住又要去赶海了！'
dict4['阿峰'] = '这是要发财的节奏！'
