#序列
a1 = 'I Love FishC.com'  #字符串
a2 = (1,2,3,4,5)         #元组
a3 = [6,7,8,9,10]        #列表
a4 = [5,3,9,0,10]       

b1 = list(a1)            #将可迭代对象转化为一个列表
b2 = list(a2)            #输出列表 [1, 2, 3, 4, 5]

c1 = tuple(a1)           #将可迭代对象转化为一个元组
c2 = tuple(a3)           #输出元组 (6, 7, 8, 9, 10)

d1 = str(a2)             #将某对象转化为一个字符串
d2 = str(a3)             #输出字符串 '[6, 7, 8, 9, 10]'

e1 = len(a1)             #返回对象的长度
e2 = max(a2)             #返回对象中的最大值
e3 = min(a2)             #返回对象中的最小值
e4 = sum(a3)             #求和
e5 = sum(a3,8)           #相当于 sum(a3)+8
e6 = sorted(a4)          #由小到大排序

f1 = reversed(a4)        #返回迭代器对象(逆转列表元素)
f2 = enumerate(a4)       #返回迭代器对象(给元素添加序号，并构成元组)
f3 = zip(a3,a4)          #返回迭代器对象(将a3和a4中的对应元素构成元组，多余元素舍去)
f4 = list(reversed(a4))  #输出列表 [10, 0, 9, 3, 5]
f5 = list(enumerate(a4)) #输出列表 [(0, 6), (1, 7), (2, 8), (3, 9), (4, 10)]
f6 = list(zip(a3,a4))    #输出列表 [(6, 5), (7, 3), (8, 9), (9, 0), (10, 10)]












